app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    @artists = Artist.all
    if params[:artist_id]
      @songs = Artist.find(params[:author_id]).songs

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find_by(id: params[:id])